[
    {
    "title": "Teachers Use iPad to Enhance Learning in Special Education Across the Globe",
    "link": "http://www.apple.com/education/real-stories/special-education/?sr=hotnews.rss",
    "image_url": "http://images.apple.com/education/real-stories/special-education/images/video-still.jpg",
    "summary": "For special education teachers around the world, iPad opens up a world of possibilities. Meet teachers at three schools — Special School Poděbrady in the Czech Republic, the Awase Special Needs School in Okinawa Prefecture, Japan, and New York’s District 75, the world’s largest special education district — and discover how they use iPad and apps to motivate learning, improve social interactions, and encourage independence in the classroom and beyond.",
    "published_date": "2014-05-20T00:54:50+00:00"
    },
    {
    "title": "Apple Updates MacBook Air",
    "link": "http://www.apple.com/macbook-air/?sr=hotnews.rss",
    "image_url": "http://images.apple.com/macbook-air/images/overview_hero_hero.jpg",
    "summary": "<p>Apple today updated the MacBook Air lineup with faster processors and lower prices. Now starting at $899, the ultra-thin notebooks feature powerful Intel Core i5 or Core i7 processors, fast flash storage, 802.11ac Wi-Fi, up to 12 hours of battery life, and Apple’s iLife and iWork apps. “With MacBook Air starting at $899, there’s no reason to settle for anything less than a Mac,” said Philip Schiller, Apple’s senior vice president of Worldwide Marketing. \"Macs have never been more popular, and today we’ve boosted the performance and lowered the price of MacBook Air so even more people can experience the perfect everyday notebook.\"</p>",
    "published_date": "2014-05-18T05:54:50+00:00"
    },
    {
    "title": "2014 NHL Playoffs: Teams Turning to High-Tech Analysis During Games",
    "link": "http://nhl.si.com/2014/04/29/2014-nhl-playoffs-teams-turning-to-high-tech-analysis-during-games/",
    "image_url": "http://cdn-jpg.si.com/sites/default/files/2014/04/ipad.jpg",
    "summary": "Sports Illustrated writes about how teams competing in the NHL’s Stanley Cup playoffs are using iPad to help. They’re analyzing video, visualizing trends, scouting opposing players, preparing for games, and more — all using apps for iPad. Coaching staff can pull out an iPad during a game and use its information to guide players in a way not possible before. “The ability to telestrate real-time on the iPad through the iBench app really allows us to not only show our players what is needed to succeed, but to teach our players how to succeed,” said L.A. Kings video coordinator Zach Ziegler.",
    "published_date": "2014-05-19T05:54:50+00:00"
    },
    {
     "title": "iOS 7.1.1 Jailbreak Successful, but Don't Count on a Public Release",
     "link": "http://www.gottabemobile.com/2014/05/19/ios-7-1-1-jailbreak-successful-but-dont-count-on-a-public-release/",
     "image_url": "http://cdn.gottabemobile.com/wp-content/uploads/2014/05/iOS-7-jailbreak1.jpg",
     "summary": "<p><a href=\"http://www.gottabemobile.com/2014/05/19/ios-7-1-1-jailbreak-successful-but-dont-count-on-a-public-release/\" rel=\"nofollow\">iOS 7.1.1 Jailbreak Successful, but Don't Count on a Public Release</a> is a post by <a href=\"http://www.gottabemobile.com/author/craig/\" rel=\"author\">Craig Lloyd</a> from <a href=\"http://www.gottabemobile.com\" rel=\"nofollow\">Gotta Be Mobile</a>.</p>\n<p>Almost a month after iOS 7.1.1 released to the public, a jailbreak has been discovered for it and it's been proven on video, as well as photographic evidence from another jailbreak hacker. The iOS 7.1 update that came out back in March was the end of Evasi0n's iOS 7 jailbreak run. It still works on iOS devices running iOS 7.0.6 or older, but if you already updated the software, you're out of luck, and you'll be hard-pressed to find a device running an older version of iOS, although you can find a few on eBay that are selling for a bit over market value. Jailbreak developers i0n1c and winocm were both able to successfully jailbreak iOS 7.1.1. i0n1c proved it by taking a photo of his iPhone 5c with the Cydia app open and having the version number displayed at the bottom, which reads 'iOS 7.1.1'. Winocm was also able to produce an iOS 7.1.1 jailbreak on her iPhone 4 and proved it on video by booting up the phone and showing us that the iPhone was indeed running iOS 7.1.1 and had Cydia installed and running, which is the big indicator that a jailbreak is successful. Winocm noted that the jailbreak hack could certainly be ported to newer iOS devices like the iPhone 5s if someone was willing to put in the effort. Seeing as how iOS 8 is just around the corner, we doubt that jailbreak developers will do that. This is still good news, as there's hope for newer devices to be jailbroken eventually, but the newer chips that these newer devices have are a lot harder to crack than the older A4 chip that's on the iPhone 4. Frankly, we're not surprised that jailbreakers have already exploited the iPhone 4 on iOS 7.1.1. The iPhone 4 is a lot easier to crack than, say, the iPhone 5s. Most likely, jailbreak developers will have to use a completely different exploit in order to jailbreak newer iOS devices, but we'll have to wait and see. We've said for awhile now that jailbreak developers will likely not release an iOS 7.1 or iOS 7.1.1 jailbreak, simply because they don't want to give away their secrets right before iOS 8 is about to be unveiled. Doing so would give Apple the chance to patch up iOS 8 and fix the exploits used for the jailbreak in iOS 7.1 and iOS 7.1.1. Granted, this isn't the first time that we've seen proof of iOS 7.1 jailbreaks. Back in March we were treated with the knowledge that an exploit was discovered in the iPhone 4 that allowed an easy iOS 7.1 jailbreak, and a few days later the iPhone 4s was cracked with an iOS 7.1 jailbreak as well. However, a public release of this is still up in the air, which is why we doubt we'll be able to get our hands on it anytime soon. There is still hope, though. It's possible that winocm could release the iPhone 4-only jailbreak at </p>\n<p><a href=\"http://www.gottabemobile.com/2014/05/19/ios-7-1-1-jailbreak-successful-but-dont-count-on-a-public-release/\" rel=\"nofollow\">iOS 7.1.1 Jailbreak Successful, but Don't Count on a Public Release</a> is a post by <a href=\"http://www.gottabemobile.com/author/craig/\" rel=\"author\">Craig Lloyd</a> from <a href=\"http://www.gottabemobile.com\" rel=\"nofollow\">Gotta Be Mobile</a>.</p>",
     "published_date": "2014-05-17T05:54:50+00:00"
    },
    {
    "title": "Next Galaxy phones, tablets to have more biometric sensors?",
    "link": "http://www.techradar.com/us/news/phone-and-communications/mobile-phones/next-galaxy-phones-tablets-to-have-more-biometric-sensors--1249486?src=rss&attr=all",
    "image_url": "http://cdn3.mos.techradar.futurecdn.net//art/other/Eye-578-80.jpg",
    "summary": "<img alt=\"Next Galaxy phones, tablets to have more biometric sensors?\" src=\"http://cdn.mos.techradar.com/art/other/Eye-470-75.jpg\" /><p>Depending what Apple jams into the <a href=\"http://www.techradar.com/news/phone-and-communications/mobile-phones/iphone-6-release-date-news-and-rumours-1099865\">iPhone 6</a>, Samsung could soon get the leg up on its rival when it comes to biometrics.</p><p>Samsung Senior Vice President Rhee In-jong reportedly said on Monday at a forum in Hong Kong that the company hopes to eventually include biometric security measures in even its low-end phones.</p><p>\"We're looking at various types of biometric [mechanisms] and one of things that everybody is looking at is iris detection,\" he said, according to The Wall Street Journal's <a href=\"http://blogs.wsj.com/digits/2014/05/19/samsung-looks-to-expand-biometric-sensors-in-mobile-devices/?mod=WSJBlog&utm_source=twitterfeed&utm_medium=twitter\">Digits</a> blog.</p><p>Apple started this train moving with the <a href=\"http://www.techradar.com/reviews/phones/mobile-phones/iphone-5s-1179315/review\">iPhone 5S</a>'s fingerprint scanner, but Rhee said Samsung is simply \"following the market trend.\"</p><h3>Eyeballs and fingerprints and more</h3><p>What do his hints mean for upcoming Samsung flagships like the <a href=\"http://www.techradar.com/news/phone-and-communications/mobile-phones/samsung-galaxy-note-4-release-date-news-and-rumors-1239700\">Samsung Galaxy Note 4</a> and <a href=\"http://www.techradar.com/news/phone-and-communications/samsung-galaxy-s6-release-date-news-and-features-1232945\">Samsung Galaxy S6</a>?</p><p>Well, Rhee also suggested that new sensor mechanisms will likely arrive in high-end phones before they trickle down the production line.</p><p>Rhee reportedly heads Samsung's mobile enterprise service <a href=\"http://www.techradar.com/news/computing/samsung-introduces-knox-2-0-brings-app-marketplace-to-enterprises-1228603\">Knox</a>, which the company hopes will ingratiate its devices with business users thanks to its security features.</p><p>He said of the 87 million devices sold that came with Knox, about 1.8 million actively use the service.</p><p>No doubt some flashy new biometrics will further increase perception of Samsung's phones as secure, even if that security may be <a href=\"http://www.techradar.com/news/phone-and-communications/mobile-phones/the-galaxy-s5-s-fingerprint-scanner-can-be-tricked-just-like-the-iphone-s-1242873\">easily bypassed</a>.</p><ul><li>Read TechRadar's reviews of the <a href=\"http://www.techradar.com/us/reviews/phones/mobile-phones/samsung-galaxy-note-3-1178226/review\">Samsung Galaxy Note 3</a> and the <a href=\"http://www.techradar.com/us/reviews/phones/mobile-phones/samsung-galaxy-s5-1226990/review\">Samsung Galaxy S5</a></li></ul><img border=\"0\" height=\"1\" src=\"http://techradar.feedsportal.com/c/34832/f/641931/s/3a98f2b2/sc/15/mf.gif\" width=\"1\" /><br clear=\"all\" /><br /><br /><a href=\"http://da.feedsportal.com/r/195506113038/u/49/f/641931/c/34832/s/3a98f2b2/sc/15/rc/1/rc.htm\" rel=\"nofollow\"><img border=\"0\" src=\"http://da.feedsportal.com/r/195506113038/u/49/f/641931/c/34832/s/3a98f2b2/sc/15/rc/1/rc.img\" /></a><br /><a href=\"http://da.feedsportal.com/r/195506113038/u/49/f/641931/c/34832/s/3a98f2b2/sc/15/rc/2/rc.htm\" rel=\"nofollow\"><img border=\"0\" src=\"http://da.feedsportal.com/r/195506113038/u/49/f/641931/c/34832/s/3a98f2b2/sc/15/rc/2/rc.img\" /></a><br /><a href=\"http://da.feedsportal.com/r/195506113038/u/49/f/641931/c/34832/s/3a98f2b2/sc/15/rc/3/rc.htm\" rel=\"nofollow\"><img border=\"0\" src=\"http://da.feedsportal.com/r/195506113038/u/49/f/641931/c/34832/s/3a98f2b2/sc/15/rc/3/rc.img\" /></a><br /><br /><a href=\"http://da.feedsportal.com/r/195506113038/u/49/f/641931/c/34832/s/3a98f2b2/sc/15/a2.htm\"><img border=\"0\" src=\"http://da.feedsportal.com/r/195506113038/u/49/f/641931/c/34832/s/3a98f2b2/sc/15/a2.img\" /></a><img border=\"0\" height=\"1\" src=\"http://pi.feedsportal.com/r/195506113038/u/49/f/641931/c/34832/s/3a98f2b2/sc/15/a2t.img\" width=\"1\" /><img height=\"1\" src=\"http://feeds.feedburner.com/~r/techradar/us/news/phone/~4/c-zPdkyIN6E\" width=\"1\" />",
    "published_date": "2014-05-16T05:54:50+00:00"
    }
]
